app/Controllers/carrito_controller.php

    public function catalogo(){
        $productoModel = new Productos_Model();
        $data['producto'] = $productoModel->orderBy('id_producto', 'DESC')->findAll();
---
SELECT *
FROM `productos`
ORDER BY `id_producto` DESC