app/Controllers/productos_controller.php

SELECT *
FROM `productos`
ORDER BY `id` DESC
---
    public function crearproducto() {
        $categoriasmodel = new Categorias_model();
        $data['categorias'] = $categoriasmodel->getCategorias();

        $productoModel = new Productos_Model();
        $data['obj'] = $productoModel->orderBy('id', 'DESC')->findAll();