app/Controllers/usuario_crud_controller.php

    public function index(){
        $userModel = new Usuarios_Model();
        $data['users'] = $userModel->orderBy('id_usuario', 'DESC')->findAll();
---
SELECT *
FROM `usuarios`
ORDER BY `id_usuario` DESC

    public function singleUser($id = null){
        $userModel = new Usuarios_Model();
        $data['user_obj'] = $userModel->where('id_usuario', $id)->first();
---
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '9'
 LIMIT 1